Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import numpy as np
import pandas as pd
series = [4,8,15,16,23,42]
new = pd.Series(series)
print(new)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [2]:
list1 = ['vidhi',1,2,3,4.5]
pd.Series(list1)

0    vidhi
1        1
2        2
3        3
4      4.5
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

In [3]:
data = {'Name ': ["Alice","Bob","Claire"],
       'Age':[25,30,27],
       "Gender":['Female',"Male","Female"]}
df = pd.DataFrame(data)
df

    Name   Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [4]:
print(df)

    Name   Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a **DataFrame** is a two-dimensional, tabular data structure that is designed to store and manipulate data in a way that is similar to a spreadsheet or SQL table. It consists of rows and columns, where each column can be of a different data type. Essentially, a DataFrame is a collection of Pandas Series that share the same index.

On the other hand, a Pandas **Series** is a one-dimensional labeled array capable of holding any data type. It is essentially a single column of a DataFrame.

In [5]:
import pandas as pd
series_data = pd.Series([4, 8, 15, 16, 23, 42], name='Numbers')
print("Pandas Series:")
print(series_data)
print("\n")
data1 = {'Numbers': [4, 8, 15, 16, 23, 42],
        'Letters': ['A', 'B', 'C', 'D', 'E', 'F']}
dt = pd.DataFrame(data1)
print("Pandas DataFrame:")
print(dt)

Pandas Series:
0     4
1     8
2    15
3    16
4    23
5    42
Name: Numbers, dtype: int64


Pandas DataFrame:
   Numbers Letters
0        4       A
1        8       B
2       15       C
3       16       D
4       23       E
5       42       F

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [7]:
dataframe = pd.read_csv('iris.csv')

In [8]:
dataframe.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [10]:
dataframe.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [11]:
dataframe.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [12]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series is mutable. You can modify the values in a Pandas Series after it has been created.

DataFrame is mutable as well. You can add, remove, or modify columns, and you can also modify the values within the DataFrame.

Panel was deprecated in recent versions of Pandas and is no longer recommended for use. Instead, for three-dimensional data, you can use a MultiIndex DataFrame.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [13]:
import pandas as pd
numbers_series = pd.Series([4, 8, 15, 16, 23, 42], name='Numbers')
letters_series = pd.Series(['A', 'B', 'C', 'D', 'E', 'F'], name='Letters')
df = pd.DataFrame({'Numbers': numbers_series, 'Letters': letters_series})
print(df)

   Numbers Letters
0        4       A
1        8       B
2       15       C
3       16       D
4       23       E
5       42       F